In [ ]:
1. Data Cleaning,EDA (Exploratory Data Analysis)
2. Text Preprocessing
3.Model Building ,Evaluation
4. Improvement
5.website building

#data cleaning

In [ ]:
import numpy as np
import pandas as pd 
#numpy library used for working with arrays

#series and data frame

In [ ]:
df = pd.read_csv('spam.csv',encoding='latin1')

In [ ]:
df.shape

(5572, 5)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5572 entries, 0 to 5571
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   v1          5572 non-null   object
 1   v2          5572 non-null   object
 2   Unnamed: 2  50 non-null     object
 3   Unnamed: 3  12 non-null     object
 4   Unnamed: 4  6 non-null      object
dtypes: object(5)
memory usage: 217.8+ KB

In [ ]:
df.head(5)

,v1,v2,Unnamed: 2,Unnamed: 3,Unnamed: 4
0,ham,"Go until jurong point, crazy.. Available only ...",NaN,NaN,NaN
1,ham,Ok lar... Joking wif u oni...,NaN,NaN,NaN
2,spam,Free entry in 2 a wkly comp to win FA Cup fina...,NaN,NaN,NaN
3,ham,U dun say so early hor... U c already then say...,NaN,NaN,NaN
4,ham,"Nah I don't think he goes to usf, he lives aro...",NaN,NaN,NaN

In [ ]:
df['v2']

0       Go until jurong point, crazy.. Available only ...
1                           Ok lar... Joking wif u oni...
2       Free entry in 2 a wkly comp to win FA Cup fina...
3       U dun say so early hor... U c already then say...
4       Nah I don't think he goes to usf, he lives aro...
                              ...
5567    This is the 2nd time we have tried 2 contact u...
5568                Will Ì_ b going to esplanade fr home?
5569    Pity, * was in mood for that. So...any other s...
5570    The guy did some bitching but I acted like i'd...
5571                           Rofl. Its true to its name
Name: v2, Length: 5572, dtype: object

In [ ]:
df.sample(5)

,v1,v2,Unnamed: 2,Unnamed: 3,Unnamed: 4
556,ham,Having lunch:)you are not in online?why?,NaN,NaN,NaN
4639,ham,Do you hide anythiing or keeping distance from me,NaN,NaN,NaN
2634,ham,"Sorry da thangam, very very sorry i am held up...",NaN,NaN,NaN
3079,ham,S.s:)i thinl role is like sachin.just standing...,NaN,NaN,NaN
318,spam,December only! Had your mobile 11mths+? You ar...,NaN,NaN,NaN

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5572 entries, 0 to 5571
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   v1          5572 non-null   object
 1   v2          5572 non-null   object
 2   Unnamed: 2  50 non-null     object
 3   Unnamed: 3  12 non-null     object
 4   Unnamed: 4  6 non-null      object
dtypes: object(5)
memory usage: 217.8+ KB

In [ ]:
print(df.columns)

Index(['v1', 'v2', 'Unnamed: 2', 'Unnamed: 3', 'Unnamed: 4'], dtype='object')

In [ ]:
df.drop(columns=['Unnamed:2', 'Unnamed:3', 'Unnamed:4'], errors='ignore', inplace=True)

In [ ]:
print(df.columns.tolist())

['v1', 'v2']

In [ ]:
df.sample(5)

        v1                                                 v2
5289   ham  Hey! Congrats 2u2. id luv 2 but ive had 2 go h...
1750   ham                         Got it..mail panren paru..
4694  spam  URGENT! Your Mobile No 07808726822 was awarded...
2963  spam  Do you ever notice that when you're driving, a...
4711   ham  Thats cool princess! I will cover your face in...

In [ ]:
#renaming the cols v1 and v2
df.rename(columns={'v1':'output','v2':'text'},inplace=True)

In [ ]:
df.sample(5)

     output                                               text
1497    ham  I'm putting it on now. It should be ready for ...
4626   spam  Please call our customer service representativ...
4164   spam  Dear Voucher Holder, To claim this weeks offer...
3190   spam  UR awarded a City Break and could WIN a å£200 ...
3735    ham  Hows the street where the end of library walk is?

In [ ]:
df['output']=df['output'].map({'ham':0,'spam':1})

In [ ]:
df.sample(5)

      output                                               text
1472       0  Just sent you an email ÛÒ to an address with ...
1776       1                  Call FREEPHONE 0800 542 0578 now!
2307       1  WIN a year supply of CDs 4 a store of ur choic...
1936       0      My planning usually stops at \find hella weed
4674       1  Hi babe its Chloe, how r u? I was smashed on s...

In [ ]:
df.isnull()

      output   text
0      False  False
1      False  False
2      False  False
3      False  False
4      False  False
...      ...    ...
5567   False  False
5568   False  False
5569   False  False
5570   False  False
5571   False  False

[5572 rows x 2 columns]

In [ ]:
df.isnull().sum()

output    0
text      0
dtype: int64

In [ ]:
df.duplicated()

0       False
1       False
2       False
3       False
4       False
        ...
5567    False
5568    False
5569    False
5570    False
5571    False
Length: 5572, dtype: bool

In [ ]:
df.duplicated().sum()

403

In [ ]:
df=df.drop_duplicates(keep='first')

In [ ]:
df.duplicated().sum()

0